---
id: for
title: for语句
sidebar_position: 4
---

# for循环

## 介绍

对于有限次的循环，用`for`语句可以说是再简单不过的方法了。`for`语句可以支持遍历有限列表内的所有项目。一般来说你能在后面看到`range()`这个神秘的函数，它的作用是构建一个由数字组成的列表。

## 代码入门

```python
for 循环变量 in 列表:
	#记得打冒号和缩进

#通常是这么用
for i in range(起始值,结束值,步长(可选)):
	#range的作用是生成一个步长为指定值的列表，但请记住范围是左闭右开
	#可以这么理解，起始值<=生成的数字的范围<结束值，步长的概念就类似等差数列的公差
	#代码在这

#关于在列表内的用法
a = [1,5,7,9,8]
for i in a:
	print(i,end=" ")
#结果为 1 5 7 9 8 
```

## 注意

- 请切记`for`后面一定要有冒号，在`for`内的代码记得缩进

- 循环变量一般来说都会用`i`、`k`、`j`等，当然你可以自己随便乱搞，只要符合变量命名规范的话

- 不要重用循环变量，即如果有多个循环嵌套的话不要使用同一个循环变量
